IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>CurrencyMovementType</name>
  <type>
    <types>EnumRef.CurrencyType</types>
  </type>
  <predefined>
    <items>
      <name>SettlementCurrency</name>
      <type>
        <types>EnumRef.CurrencyType</types>
      </type>
    </items>
    <items>
      <name>Default_PartnerTerm</name>
      <type>
        <types>EnumRef.CurrencyType</types>
      </type>
    </items>
    <items>
      <name>Default_Legal</name>
      <type>
        <types>EnumRef.CurrencyType</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.CurrencyType</types>
    </type>
  </attributes>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NotPostIfRateNotSet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EverydayRates</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.Ref = ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency
	 Or ThisObject.Ref = ChartsOfCharacteristicTypes.CurrencyMovementType.Default_Legal
	 Or ThisObject.Ref = ChartsOfCharacteristicTypes.CurrencyMovementType.Default_PartnerTerm Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Currency");	
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Source");	
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Type");	
	EndIf;
EndProcedure
